# 'brew tap'
tap "g6ai/ale"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "macvim-dev/macvim"
tap "railwaycat/emacsmacport"
tap "wez/wezterm"

# 'brew install'
brew "chezmoi"
brew "docx2txt"
brew "emacs-mac", args: ["with-natural-title-bar"]
brew "ext4fuse"
brew "frpc"
brew "gnu-sed"
brew "grip" # required by vim-markdown-preview
brew "languagetool"
brew "media-info"
brew "nginx", restart_service: true
brew "pyenv-virtualenv"
brew "sphinx-doc"
brew "switchaudio-osx"
brew "tty-clock"
brew "winetricks"

# 'brew install --cask'
cask "alt-tab"
cask "background-music-pre"
cask "brooklyn"
cask "calibre"
cask "cyberduck"
cask "dictunifier"
cask "docker"
cask "dynamic-dark-mode"
cask "eudic"
cask "fiji"
cask "font-jetbrains-mono-nerd-font"
cask "gimp"
cask "google-drive"
cask "google-drive-file-stream"
cask "google-earth-pro"
cask "gray"
cask "hackintool"
cask "image2icon"
cask "kap"
cask "karabiner-elements"
cask "keka"
cask "kitty"
cask "language-switcher"
cask "macvim"
cask "microsoft-teams"
cask "mpv"
cask "ngrok"
cask "obs"
cask "openemu"
cask "osxfuse"
cask "qlmarkdown"
cask "qlvideo"
cask "qt-creator"
cask "qtspim"
cask "raspberry-pi-imager"
cask "skim"
cask "slack"
cask "telegram-desktop"
cask "tencent-lemon"
cask "wez/wezterm/wezterm-nightly"
cask "wine-stable-4"
cask "xquartz"
cask "zoom"
